In [1]:
import pandas as pd

# weather data is from https://meteo.physic.ut.ee/ archives
w_data = pd.read_csv('weather.csv')

C:\Users\Emma Belinda\Anaconda\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (4) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [3]:
w_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 204481 entries, 0 to 204480
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Aeg           204481 non-null  object
 1    Temperatuur  204481 non-null  object
 2    Niiskus      204481 non-null  object
 3   Ohurohk       204481 non-null  object
 4    Sademed      204481 non-null  object
dtypes: object(5)
memory usage: 7.8+ MB

In [190]:
data1 = w_data.copy()

In [191]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 204481 entries, 0 to 204480
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Aeg           204481 non-null  object
 1    Temperatuur  204481 non-null  object
 2    Niiskus      204481 non-null  object
 3   Ohurohk       204481 non-null  object
 4    Sademed      204481 non-null  object
dtypes: object(5)
memory usage: 7.8+ MB

In [192]:
# Creating a new column with only date
data1['Aeg'] = pd.to_datetime(data1['Aeg'], format='%d/%m/%Y %H:%M')
data1['Kuupaev'] = data1['Aeg'].dt.strftime('%Y-%m-%d')

In [193]:
data1['Kuupaev'] = pd.to_datetime(data1['Kuupaev'], format='%Y-%m-%d')

In [194]:
data1 = data1.set_axis(['Aeg', 'Temperatuur', 'Niiskus', 'Ohurohk', 'Sademed', 'Kuupaev'], axis=1, inplace=False)

In [195]:
# converting other columns values from object to float
data1['Temperatuur'] = pd.to_numeric(data1['Temperatuur'], errors='coerce')
data1['Niiskus'] = pd.to_numeric(data1['Niiskus'], errors='coerce')
data1['Ohurohk'] = pd.to_numeric(data1['Ohurohk'], errors='coerce')
data1['Sademed'] = pd.to_numeric(data1['Sademed'], errors='coerce')

In [196]:
#data1 = data1.dropna()
data1 = data1.reset_index()
data1 = data1.drop(['index', 'Aeg', 'Sademed', 'Ohurohk'], axis=1)

In [197]:
data1['Andmeid_paeva_kohta'] = 1

In [198]:
data1

        Temperatuur    Niiskus    Kuupaev  Andmeid_paeva_kohta
0          8.888103  76.708692 2019-06-01                    1
1          8.753599  79.296941 2019-06-01                    1
2          8.788582  78.446237 2019-06-01                    1
3          8.810311  77.352591 2019-06-01                    1
4          8.575596  79.479611 2019-06-01                    1
...             ...        ...        ...                  ...
204476     5.874293  78.252298 2021-04-30                    1
204477     5.841596  78.804838 2021-04-30                    1
204478     5.846684  78.970810 2021-04-30                    1
204479     5.841117  78.944670 2021-04-30                    1
204480     5.825572  78.991542 2021-04-30                    1

[204481 rows x 4 columns]

In [199]:
loplik = data1.copy()

loplik = loplik.groupby(by=['Kuupaev'], as_index=False).sum()

In [200]:
loplik

       Kuupaev  Temperatuur       Niiskus  Andmeid_paeva_kohta
0   2019-06-01  3765.295872  14669.504661                  276
1   2019-06-02  4164.627479  19753.042270                  288
2   2019-06-03  4074.895458  16507.607284                  288
3   2019-06-04  6149.540224  14202.526744                  288
4   2019-06-05  6844.450428  13987.500523                  288
..         ...          ...           ...                  ...
695 2021-04-26   761.805740  25165.360869                  288
696 2021-04-27  1154.862484  25684.772182                  288
697 2021-04-28  1035.303020  20509.088049                  288
698 2021-04-29  1540.937792  20064.522971                  288
699 2021-04-30    70.775499    936.714656                   12

[700 rows x 4 columns]

In [201]:
for i in range(700):
    jagada = loplik.iloc[i, 3]
    temp = loplik.at[i, 'Temperatuur']
    niiskus = loplik.at[i, 'Niiskus']
    loplik.at[i, 'Temperatuur'] = round(temp / jagada)
    loplik.at[i, 'Niiskus'] = round(niiskus / jagada)

In [203]:
loplik['Temperatuur'] = loplik['Temperatuur'].astype(int)
loplik['Niiskus'] = loplik['Niiskus'].astype(int)

In [204]:
loplik

       Kuupaev  Temperatuur  Niiskus  Andmeid_paeva_kohta
0   2019-06-01           14       53                  276
1   2019-06-02           14       69                  288
2   2019-06-03           14       57                  288
3   2019-06-04           21       49                  288
4   2019-06-05           24       49                  288
..         ...          ...      ...                  ...
695 2021-04-26            3       87                  288
696 2021-04-27            4       89                  288
697 2021-04-28            4       71                  288
698 2021-04-29            5       70                  288
699 2021-04-30            6       78                   12

[700 rows x 4 columns]

In [205]:
from sklearn import datasets

%store loplik

Stored 'loplik' (DataFrame)